export interface MovieProps{
    title: string;
    year: number;
    actors: string;
    genres: string;
    description?: string;
  }
  
export const movieWithoutDescription: MovieProps = {
    title: 'Пташиний короб',
    year: 2023,
    actors: "Пріянка Чопра, Сем Г'юен, Céline Dion, Sofia Barclay, Рассел Тоуві, Lydia West",
    genres: 'Мелодрами , Комедія , Драми',
  }

export const movieWithDescription: MovieProps = {
    title: "Законсервований по-американськи / Американський огірочок",
    year: 2020,
    actors: "Сет Роґен, Сара Снук, Molly Evensen, Eliot Glazer, Kalen Allen, Кевін О'рурк",
    genres: "Комедія , Драми",
    description: "Початок 20-ого століття знаменується значною подією для Гершеля Грінбаума: уклавши шлюб з Сарою, він, сповнений інтересу, прямує до Нью-Йорка, щоб побудувати міцну ланку суспільства, втіливши в життя всі мрії. Перші кроки на шляху до світлого майбутнього розпочинаються на заводі з виробництва солоних огірків. Одного разу з ним трапляється біда - чоловік випадково падає в бочку з маринадом, яку відразу консервують до кращих часів. Так минає 100 років, після чого головний герой фільму «Американський огірок» знову з'являється на світ, але вже в 21 столітті, проте з ним практично не відбулося жодних змін з того злощасного дня. З часом він знаходить правнука-програміста: з цього моменту родичів чекає безліч пригод, цікавих і часом небезпечних..."
  }
  